#### Terraform Apply 📖`success`

<details><summary>Show Apply</summary>

```

terraform
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/julinuxops-demo/orderful-dev/runs/run-sWagLCiULMhCYNhU

Waiting for 1 run(s) to finish before being queued...

Terraform v1.2.7
on linux_amd64
Initializing plugins and modules...
module.ecs.data.cloudinit_config.config: Reading...
module.ecs.data.cloudinit_config.config: Read complete after 0s [id=2239648864]
module.ecs.data.aws_region.current: Reading...
data.aws_availability_zones.available: Reading...
module.ecs.data.aws_iam_policy_document.allow_create_log_groups: Reading...
module.vpc.data.aws_region.current: Reading...
module.ecs.data.aws_ami.ecs: Reading...
module.ecs.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ecs.data.aws_iam_policy_document.ecs_service_auto_scaling: Reading...
module.ecs.data.aws_iam_policy_document.ecs_service_role_policy: Reading...
module.ecs.data.aws_iam_policy_document.allow_create_log_groups: Read complete after 0s [id=2633989885]
module.ecs.data.aws_iam_policy_document.ecs_service_role_policy: Read complete after 0s [id=2720552519]
module.ecs.data.aws_iam_policy_document.ecs_task_policy: Reading...
module.ecs.data.aws_iam_policy_document.ecs_service_auto_scaling: Read complete after 0s [id=3660475980]
module.ecs.data.aws_iam_policy_document.ecs_task_policy: Read complete after 0s [id=320642683]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.ecs.data.aws_ami.ecs: Read complete after 0s [id=ami-061c737b1691cb15f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ecs.aws_appautoscaling_policy.CPUTaskAutoScaling will be created
  + resource "aws_appautoscaling_policy" "CPUTaskAutoScaling" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "ecs-task-cpu-autoscaling"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/orderful-cluster/orderful-test-app"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_policy.MemoryTaskAutoScaling will be created
  + resource "aws_appautoscaling_policy" "MemoryTaskAutoScaling" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "ecs-task-memory-autoscaling"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/orderful-cluster/orderful-test-app"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_target.ecs_target will be created
  + resource "aws_appautoscaling_target" "ecs_target" {
      + id                 = (known after apply)
      + max_capacity       = 8
      + min_capacity       = 4
      + resource_id        = "service/orderful-cluster/orderful-test-app"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
    }

  # module.ecs.aws_autoscaling_group.orderful will be created
  + resource "aws_autoscaling_group" "orderful" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 2
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "EC2"
      + id                        = (known after apply)
      + max_size                  = 4
      + metrics_granularity       = "1Minute"
      + min_size                  = 2
      + name                      = "orderful-ecs-cluster"
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "AmazonECSManaged"
          + propagate_at_launch = true
          + value               = "true"
        }
    }

  # module.ecs.aws_cloudfront_distribution.orderful will be created
  + resource "aws_cloudfront_distribution" "orderful" {
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 0
          + max_ttl                = 0
          + min_ttl                = 0
          + target_origin_id       = (known after apply)
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = [
                  + "*",
                ]
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "all"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = (known after apply)

          + custom_header {
              + name  = "X-Orderful-Origin"
              + value = "68e109f0f40ca72a15e05cc22786f8e6"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "SSLv3",
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # module.ecs.aws_cloudwatch_log_group.ecs_tasks_logs will be created
  + resource "aws_cloudwatch_log_group" "ecs_tasks_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/devops-challenge"
      + retention_in_days = 0
      + tags_all          = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }
    }

  # module.ecs.aws_ecs_capacity_provider.ecs_cluster will be created
  + resource "aws_ecs_capacity_provider" "ecs_cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "orderful-ecs-cp"
      + tags_all = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }

      + auto_scaling_group_provider {
          + auto_scaling_group_arn         = (known after apply)
          + managed_termination_protection = (known after apply)

          + managed_scaling {
              + instance_warmup_period    = (known after apply)
              + maximum_scaling_step_size = (known after apply)
              + minimum_scaling_step_size = (known after apply)
              + status                    = (known after apply)
              + target_capacity           = (known after apply)
            }
        }
    }

  # module.ecs.aws_ecs_cluster.orderful will be created
  + resource "aws_ecs_cluster" "orderful" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "orderful-cluster"
      + tags_all           = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs.aws_ecs_cluster_capacity_providers.orderful will be created
  + resource "aws_ecs_cluster_capacity_providers" "orderful" {
      + capacity_providers = [
          + "orderful-ecs-cp",
        ]
      + cluster_name       = "orderful-cluster"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "orderful-ecs-cp"
          + weight            = 0
        }
    }

  # module.ecs.aws_ecs_service.test-app will be created
  + resource "aws_ecs_service" "test-app" {
      + cluster                            = "orderful-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 4
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "orderful-test-app"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }
      + task_definition                    = "test-app"
      + wait_for_steady_state              = false

      + capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "orderful-ecs-cp"
          + weight            = 1
        }

      + load_balancer {
          + container_name   = "test-app"
          + container_port   = 4545
          + target_group_arn = (known after apply)
        }

      + ordered_placement_strategy {
          + field = "cpu"
          + type  = "binpack"
        }
    }

  # module.ecs.aws_ecs_task_definition.test-app will be created
  + resource "aws_ecs_task_definition" "test-app" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment       = [
                      + {
                          + name  = "MODE"
                          + value = "real"
                        },
                      + {
                          + name  = "NODE_ENV"
                          + value = "prod"
                        },
                    ]
                  + essential         = true
                  + image             = "public.ecr.aws/j3t8a0t2/devops-challenge:latest"
                  + logConfiguration  = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-create-group  = "true"
                          + awslogs-group         = "/aws/ecs/devops-challenge"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "devops-challenge"
                        }
                    }
                  + memoryReservation = 256
                  + mountPoints       = []
                  + name              = "test-app"
                  + portMappings      = [
                      + {
                          + containerPort = 4545
                          + hostPort      = 0
                        },
                    ]
                },
            ]
        )
      + execution_role_arn       = (known after apply)
      + family                   = "test-app"
      + id                       = (known after apply)
      + network_mode             = "bridge"
      + requires_compatibilities = [
          + "EC2",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }
      + task_role_arn            = (known after apply)
    }

  # module.ecs.aws_iam_instance_profile.ecs will be created
  + resource "aws_iam_instance_profile" "ecs" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ECSInstanceProfile"
      + path        = "/"
      + role        = "orderful-ecs-instance-role"
      + tags_all    = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }
      + unique_id   = (known after apply)
    }

  # module.ecs.aws_iam_role.ecs_service will be created
  + resource "aws_iam_role" "ecs_service" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "ecs-tasks.amazonaws.com",
                              + "ec2.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "orderful-ecs-instance-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.ecs.aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.ecs.aws_iam_role_policy.allow_create_log_groups will be created
  + resource "aws_iam_role_policy" "allow_create_log_groups" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.ecs.aws_iam_role_policy.autoscaling_policy will be created
  + resource "aws_iam_role_policy" "autoscaling_policy" {
      + id     = (known after apply)
      + name   = "ECSAutoScalingPolicy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sns:Subscribe",
                          + "sns:List*",
                          + "sns:Get*",
                          + "sns:CreateTopic",
                          + "iam:CreateServiceLinkedRole",
                          + "ecs:UpdateService",
                          + "ecs:DescribeServices",
                          + "cloudwatch:PutMetricAlarm",
                          + "cloudwatch:ListMetrics",
                          + "cloudwatch:GetMetricStatistics",
                          + "cloudwatch:EnableAlarmActions",
                          + "cloudwatch:DisableAlarmActions",
                          + "cloudwatch:DescribeAlarmsForMetric",
                          + "cloudwatch:DescribeAlarms",
                          + "cloudwatch:DescribeAlarmHistory",
                          + "cloudwatch:DeleteAlarms",
                          + "application-autoscaling:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.ecs.aws_iam_role_policy_attachment.default_task_role will be created
  + resource "aws_iam_role_policy_attachment" "default_task_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "ecs-task-role"
    }

  # module.ecs.aws_iam_role_policy_attachment.ecs_instance_role will be created
  + resource "aws_iam_role_policy_attachment" "ecs_instance_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "orderful-ecs-instance-role"
    }

  # module.ecs.aws_iam_role_policy_attachment.task_execution_role will be created
  + resource "aws_iam_role_policy_attachment" "task_execution_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "orderful-ecs-instance-role"
    }

  # module.ecs.aws_key_pair.key will be created
  + resource "aws_key_pair" "key" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "deployer"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDQlORKUOuEpu0EbqSEMWXqiAwR4lksJf9gvNhWToxVEf5s8uhBe8B63UjKprHuCdERz7Noh6nuyVTVC+h7E/HDKft9EJsQ9VK+BEjfNG4WR1FrxrrureqoFz+y9w2tzmU4gp+kNDT1DiLlJwsNeUlvjrXVwVy4LCAba6oUdcajyDBOu4jIPXtA3VihXp6icw5/9OEHaX+p5Qi1lspAJ98cigRPO1dnsoUjYzoNshBR0n/3Me060Z4Liwk7P/4/jrIax1wPuGleWf6hAsjoHtM9vixeWVIleWX4df29+ueuKKw74/Egy7YylFscH6oJ4LZbuNeSDFuKFRTf/7zs2785"
      + tags_all        = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }
    }

  # module.ecs.aws_launch_template.ecs_instance_template will be created
  + resource "aws_launch_template" "ecs_instance_template" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-061c737b1691cb15f"
      + instance_type          = "t3.small"
      + key_name               = "deployer"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ecs_node_"
      + tags_all               = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }
      + user_data              = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQveC1zaGVsbHNjcmlwdA0KTWltZS1WZXJzaW9uOiAxLjANCg0KIyEvYmluL2Jhc2gKZWNobyBFQ1NfQ0xVU1RFUj0ib3JkZXJmdWwtY2x1c3RlciIgPj4gL2V0Yy9lY3MvZWNzLmNvbmZpZwoNCi0tTUlNRUJPVU5EQVJZLS0NCg=="
      + vpc_security_group_ids = (known after apply)

      + iam_instance_profile {
          + name = "ECSInstanceProfile"
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }
    }

  # module.ecs.aws_lb.orderful will be created
  + resource "aws_lb" "orderful" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "orderful-lb-test-app"
      + preserve_host_header       = false
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags_all                   = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.ecs.aws_lb_listener.orderful will be created
  + resource "aws_lb_listener" "orderful" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/html"
              + message_body = "<h1>Access Denied</h1>"
              + status_code  = "403"
            }
        }
    }

  # module.ecs.aws_lb_listener_rule.orderful-listener-rule will be created
  + resource "aws_lb_listener_rule" "orderful-listener-rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 1
      + tags_all     = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {

          + http_header {
              + http_header_name = "X-Orderful-Origin"
              + values           = [
                  + "68e109f0f40ca72a15e05cc22786f8e6",
                ]
            }
        }
    }

  # module.ecs.aws_lb_target_group.orderful will be created
  + resource "aws_lb_target_group" "orderful" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "orderful-ecs-app"
      + port                               = 4545
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/api/health/check"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.ecs.aws_security_group.allow-http will be created
  + resource "aws_security_group" "allow-http" {
      + arn                    = (known after apply)
      + description            = "Allow HTTP requests from Anywhere."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "allow-http-from-anywhere"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }
      + vpc_id                 = (known after apply)
    }

  # module.ecs.aws_security_group.ecs-service will be created
  + resource "aws_security_group" "ecs-service" {
      + arn                    = (known after apply)
      + description            = "Access for the ECS Service"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "Allow Connections to ECS"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }
      + vpc_id                 = (known after apply)
    }

  # module.subnet-us-east-1a.aws_eip.public will be created
  + resource "aws_eip" "public" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }
      + vpc                  = true
    }

  # module.subnet-us-east-1a.aws_nat_gateway.public will be created
  + resource "aws_nat_gateway" "public" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags_all             = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }
    }

  # module.subnet-us-east-1a.aws_route.private will be created
  + resource "aws_route" "private" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.subnet-us-east-1a.aws_route.public will be created
  + resource "aws_route" "public" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.subnet-us-east-1a.aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "orderful-rtb-private-us-east-1a"
        }
      + tags_all         = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "orderful-rtb-private-us-east-1a"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }
      + vpc_id           = (known after apply)
    }

  # module.subnet-us-east-1a.aws_route_table_association.private will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.subnet-us-east-1a.aws_route_table_association.public will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.subnet-us-east-1a.aws_subnet.private will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.16.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "orderful-subnet-private-us-east-1a"
        }
      + tags_all                                       = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "orderful-subnet-private-us-east-1a"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet-us-east-1a.aws_subnet.public will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.16.112.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "orderful-subnet-public-us-east-1a"
        }
      + tags_all                                       = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "orderful-subnet-public-us-east-1a"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet-us-east-1b.aws_eip.public will be created
  + resource "aws_eip" "public" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }
      + vpc                  = true
    }

  # module.subnet-us-east-1b.aws_nat_gateway.public will be created
  + resource "aws_nat_gateway" "public" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags_all             = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }
    }

  # module.subnet-us-east-1b.aws_route.private will be created
  + resource "aws_route" "private" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.subnet-us-east-1b.aws_route.public will be created
  + resource "aws_route" "public" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.subnet-us-east-1b.aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "orderful-rtb-private-us-east-1b"
        }
      + tags_all         = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "orderful-rtb-private-us-east-1b"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }
      + vpc_id           = (known after apply)
    }

  # module.subnet-us-east-1b.aws_route_table_association.private will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.subnet-us-east-1b.aws_route_table_association.public will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.subnet-us-east-1b.aws_subnet.private will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.16.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "orderful-subnet-private-us-east-1b"
        }
      + tags_all                                       = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "orderful-subnet-private-us-east-1b"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet-us-east-1b.aws_subnet.public will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.16.128.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "orderful-subnet-public-us-east-1b"
        }
      + tags_all                                       = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "orderful-subnet-public-us-east-1b"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_internet_gateway.orderful will be created
  + resource "aws_internet_gateway" "orderful" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "orderful-igw"
        }
      + tags_all = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "orderful-igw"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "orderful-rtb-public"
        }
      + tags_all         = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "orderful-rtb-public"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_vpc.orderful will be created
  + resource "aws_vpc" "orderful" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.16.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "orderful-vpc"
        }
      + tags_all                             = {
          + "Environment" = "orderful-dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "orderful-vpc"
          + "Owner"       = "DevOps"
          + "Project"     = "Orderful Devops Challenge"
        }
    }

Plan: 48 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + endpoint_url = (known after apply)

module.subnet-us-east-1a.aws_eip.public: Creating...
module.vpc.aws_vpc.orderful: Creating...
module.ecs.aws_key_pair.key: Creating...
module.subnet-us-east-1b.aws_eip.public: Creating...
module.ecs.aws_iam_role.ecs_task: Creating...
module.ecs.aws_ecs_cluster.orderful: Creating...
module.ecs.aws_iam_role.ecs_service: Creating...
module.ecs.aws_cloudwatch_log_group.ecs_tasks_logs: Creation complete after 1s [id=/aws/ecs/devops-challenge]
module.ecs.aws_key_pair.key: Creation complete after 1s [id=deployer]
module.subnet-us-east-1b.aws_eip.public: Creation complete after 1s [id=eipalloc-07c5c60605ffe75e1]
module.subnet-us-east-1a.aws_eip.public: Creation complete after 1s [id=eipalloc-04593c96134c68126]
module.ecs.aws_iam_role.ecs_service: Creation complete after 1s [id=orderful-ecs-instance-role]
module.ecs.aws_iam_role_policy_attachment.ecs_instance_role: Creating...
module.ecs.aws_iam_role_policy_attachment.task_execution_role: Creating...
module.ecs.aws_iam_role_policy.autoscaling_policy: Creating...
module.ecs.aws_iam_instance_profile.ecs: Creating...
module.ecs.aws_iam_role.ecs_task: Creation complete after 1s [id=ecs-task-role]
module.ecs.aws_iam_role_policy_attachment.default_task_role: Creating...
module.ecs.aws_iam_role_policy.allow_create_log_groups: Creating...
module.ecs.aws_ecs_task_definition.test-app: Creating...
module.ecs.aws_iam_role_policy_attachment.ecs_instance_role: Creation complete after 0s [id=orderful-ecs-instance-role-20220823015404095900000002]
module.ecs.aws_iam_role_policy.autoscaling_policy: Creation complete after 0s [id=orderful-ecs-instance-role:ECSAutoScalingPolicy]
module.ecs.aws_iam_role_policy_attachment.task_execution_role: Creation complete after 0s [id=orderful-ecs-instance-role-20220823015404102800000003]
module.ecs.aws_ecs_task_definition.test-app: Creation complete after 0s [id=test-app]
module.ecs.aws_iam_role_policy_attachment.default_task_role: Creation complete after 0s [id=ecs-task-role-20220823015404113800000004]
module.ecs.aws_iam_role_policy.allow_create_log_groups: Creation complete after 0s [id=ecs-task-role:terraform-20220823015404047300000001]
module.ecs.aws_iam_instance_profile.ecs: Creation complete after 0s [id=ECSInstanceProfile]
module.vpc.aws_vpc.orderful: Still creating... [10s elapsed]
module.ecs.aws_ecs_cluster.orderful: Still creating... [10s elapsed]
module.ecs.aws_ecs_cluster.orderful: Creation complete after 11s [id=arn:aws:ecs:us-east-1:702160845026:cluster/orderful-cluster]
module.vpc.aws_vpc.orderful: Creation complete after 12s [id=vpc-0a0caaf19e74ff05f]
module.vpc.aws_internet_gateway.orderful: Creating...
module.vpc.aws_route_table.public: Creating...
module.subnet-us-east-1a.aws_route_table.private: Creating...
module.subnet-us-east-1a.aws_subnet.public: Creating...
module.ecs.aws_security_group.allow-http: Creating...
module.subnet-us-east-1a.aws_subnet.private: Creating...
module.ecs.aws_lb_target_group.orderful: Creating...
module.subnet-us-east-1b.aws_subnet.private: Creating...
module.subnet-us-east-1b.aws_route_table.private: Creating...
module.subnet-us-east-1b.aws_subnet.public: Creating...
module.ecs.aws_lb_target_group.orderful: Creation complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:702160845026:targetgroup/orderful-ecs-app/600bf9e62330b80d]
module.vpc.aws_route_table.public: Creation complete after 0s [id=rtb-05681736f11235141]
module.subnet-us-east-1a.aws_route_table.private: Creation complete after 0s [id=rtb-07be1bddb567c1313]
module.vpc.aws_internet_gateway.orderful: Creation complete after 0s [id=igw-03ec1bd058ecf4383]
module.subnet-us-east-1a.aws_route.public: Creating...
module.subnet-us-east-1b.aws_route.public: Creating...
module.subnet-us-east-1b.aws_route_table.private: Creation complete after 0s [id=rtb-02bb5ea54a13b40e7]
module.subnet-us-east-1b.aws_subnet.private: Creation complete after 0s [id=subnet-0fb070d8d7d1e60a1]
module.subnet-us-east-1b.aws_route_table_association.private: Creating...
module.subnet-us-east-1a.aws_subnet.private: Creation complete after 0s [id=subnet-032210056ca52d540]
module.subnet-us-east-1a.aws_route_table_association.private: Creating...
module.subnet-us-east-1a.aws_route_table_association.private: Creation complete after 0s [id=rtbassoc-0af2b6614ded6de1c]
module.subnet-us-east-1b.aws_route_table_association.private: Creation complete after 0s [id=rtbassoc-0337950d2af30591b]
module.subnet-us-east-1b.aws_route.public: Creation complete after 0s [id=r-rtb-05681736f112351411080289494]
module.subnet-us-east-1a.aws_route.public: Creation complete after 0s [id=r-rtb-05681736f112351411080289494]
module.ecs.aws_security_group.allow-http: Creation complete after 1s [id=sg-07ea3506dacfa0523]
module.ecs.aws_security_group.ecs-service: Creating...
module.ecs.aws_security_group.ecs-service: Creation complete after 2s [id=sg-0ee4e0a27e25e928c]
module.ecs.aws_launch_template.ecs_instance_template: Creating...
module.ecs.aws_launch_template.ecs_instance_template: Creation complete after 0s [id=lt-07e30b5b91f178420]
module.ecs.aws_autoscaling_group.orderful: Creating...
module.subnet-us-east-1a.aws_subnet.public: Still creating... [10s elapsed]
module.subnet-us-east-1b.aws_subnet.public: Still creating... [10s elapsed]
module.subnet-us-east-1a.aws_subnet.public: Creation complete after 10s [id=subnet-04d6aca5a8b897c06]
module.subnet-us-east-1a.aws_route_table_association.public: Creating...
module.subnet-us-east-1a.aws_nat_gateway.public: Creating...
module.subnet-us-east-1b.aws_subnet.public: Creation complete after 10s [id=subnet-0caa30ba8c7da16d5]
module.subnet-us-east-1b.aws_route_table_association.public: Creating...
module.subnet-us-east-1b.aws_nat_gateway.public: Creating...
module.ecs.aws_lb.orderful: Creating...
module.subnet-us-east-1a.aws_route_table_association.public: Creation complete after 1s [id=rtbassoc-082cf7c9c4c75e57a]
module.subnet-us-east-1b.aws_route_table_association.public: Creation complete after 1s [id=rtbassoc-057919e1a6acce845]
module.ecs.aws_autoscaling_group.orderful: Still creating... [10s elapsed]
module.subnet-us-east-1a.aws_nat_gateway.public: Still creating... [10s elapsed]
module.subnet-us-east-1b.aws_nat_gateway.public: Still creating... [10s elapsed]
module.ecs.aws_lb.orderful: Still creating... [10s elapsed]
module.ecs.aws_autoscaling_group.orderful: Still creating... [20s elapsed]
module.ecs.aws_autoscaling_group.orderful: Creation complete after 26s [id=orderful-ecs-cluster]
module.ecs.aws_ecs_capacity_provider.ecs_cluster: Creating...
module.ecs.aws_ecs_capacity_provider.ecs_cluster: Creation complete after 0s [id=arn:aws:ecs:us-east-1:702160845026:capacity-provider/orderful-ecs-cp]
module.ecs.aws_ecs_cluster_capacity_providers.orderful: Creating...
module.ecs.aws_ecs_service.test-app: Creating...
module.subnet-us-east-1a.aws_nat_gateway.public: Still creating... [20s elapsed]
module.subnet-us-east-1b.aws_nat_gateway.public: Still creating... [20s elapsed]
module.ecs.aws_lb.orderful: Still creating... [20s elapsed]
module.ecs.aws_ecs_cluster_capacity_providers.orderful: Still creating... [10s elapsed]
module.ecs.aws_ecs_service.test-app: Still creating... [10s elapsed]
module.ecs.aws_ecs_cluster_capacity_providers.orderful: Creation complete after 11s [id=orderful-cluster]
module.subnet-us-east-1a.aws_nat_gateway.public: Still creating... [30s elapsed]
module.subnet-us-east-1b.aws_nat_gateway.public: Still creating... [30s elapsed]
module.ecs.aws_lb.orderful: Still creating... [30s elapsed]
module.ecs.aws_ecs_service.test-app: Still creating... [20s elapsed]
module.subnet-us-east-1a.aws_nat_gateway.public: Still creating... [40s elapsed]
module.subnet-us-east-1b.aws_nat_gateway.public: Still creating... [40s elapsed]
module.ecs.aws_lb.orderful: Still creating... [40s elapsed]
module.ecs.aws_ecs_service.test-app: Still creating... [30s elapsed]
module.subnet-us-east-1a.aws_nat_gateway.public: Still creating... [50s elapsed]
module.subnet-us-east-1b.aws_nat_gateway.public: Still creating... [50s elapsed]
module.ecs.aws_lb.orderful: Still creating... [50s elapsed]
module.ecs.aws_ecs_service.test-app: Still creating... [40s elapsed]
module.subnet-us-east-1a.aws_nat_gateway.public: Still creating... [1m0s elapsed]
module.subnet-us-east-1b.aws_nat_gateway.public: Still creating... [1m0s elapsed]
module.ecs.aws_lb.orderful: Still creating... [1m0s elapsed]
module.ecs.aws_ecs_service.test-app: Still creating... [50s elapsed]
module.subnet-us-east-1a.aws_nat_gateway.public: Still creating... [1m10s elapsed]
module.subnet-us-east-1b.aws_nat_gateway.public: Still creating... [1m10s elapsed]
module.ecs.aws_lb.orderful: Still creating... [1m10s elapsed]
module.ecs.aws_ecs_service.test-app: Still creating... [1m0s elapsed]
module.subnet-us-east-1a.aws_nat_gateway.public: Still creating... [1m20s elapsed]
module.subnet-us-east-1b.aws_nat_gateway.public: Still creating... [1m20s elapsed]
module.ecs.aws_lb.orderful: Still creating... [1m20s elapsed]
module.ecs.aws_ecs_service.test-app: Still creating... [1m10s elapsed]
module.subnet-us-east-1a.aws_nat_gateway.public: Still creating... [1m30s elapsed]
module.subnet-us-east-1b.aws_nat_gateway.public: Still creating... [1m30s elapsed]
module.ecs.aws_lb.orderful: Still creating... [1m30s elapsed]
module.ecs.aws_ecs_service.test-app: Still creating... [1m20s elapsed]
module.subnet-us-east-1a.aws_nat_gateway.public: Still creating... [1m40s elapsed]
module.subnet-us-east-1b.aws_nat_gateway.public: Still creating... [1m40s elapsed]
module.ecs.aws_lb.orderful: Still creating... [1m40s elapsed]
module.ecs.aws_ecs_service.test-app: Still creating... [1m30s elapsed]
module.subnet-us-east-1a.aws_nat_gateway.public: Still creating... [1m50s elapsed]
module.subnet-us-east-1b.aws_nat_gateway.public: Still creating... [1m50s elapsed]
module.ecs.aws_lb.orderful: Still creating... [1m50s elapsed]
module.subnet-us-east-1a.aws_nat_gateway.public: Creation complete after 1m54s [id=nat-06cb52d2bd1e0b04d]
module.subnet-us-east-1a.aws_route.private: Creating...
module.subnet-us-east-1a.aws_route.private: Creation complete after 1s [id=r-rtb-07be1bddb567c13131080289494]
module.ecs.aws_ecs_service.test-app: Still creating... [1m40s elapsed]
module.subnet-us-east-1b.aws_nat_gateway.public: Still creating... [2m0s elapsed]
module.ecs.aws_lb.orderful: Still creating... [2m0s elapsed]
module.ecs.aws_ecs_service.test-app: Still creating... [1m50s elapsed]
module.subnet-us-east-1b.aws_nat_gateway.public: Still creating... [2m10s elapsed]
module.ecs.aws_lb.orderful: Still creating... [2m10s elapsed]
module.ecs.aws_lb.orderful: Creation complete after 2m12s [id=arn:aws:elasticloadbalancing:us-east-1:702160845026:loadbalancer/app/orderful-lb-test-app/0bb3dcac8da88464]
module.ecs.aws_lb_listener.orderful: Creating...
module.ecs.aws_cloudfront_distribution.orderful: Creating...
module.ecs.aws_lb_listener.orderful: Creation complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:702160845026:listener/app/orderful-lb-test-app/0bb3dcac8da88464/9232f8473a385d14]
module.ecs.aws_lb_listener_rule.orderful-listener-rule: Creating...
module.ecs.aws_lb_listener_rule.orderful-listener-rule: Creation complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:702160845026:listener-rule/app/orderful-lb-test-app/0bb3dcac8da88464/9232f8473a385d14/6042fdc1327d105d]
module.subnet-us-east-1b.aws_nat_gateway.public: Creation complete after 2m15s [id=nat-06f20427745085772]
module.subnet-us-east-1b.aws_route.private: Creating...
module.subnet-us-east-1b.aws_route.private: Creation complete after 1s [id=r-rtb-02bb5ea54a13b40e71080289494]
module.ecs.aws_ecs_service.test-app: Creation complete after 1m59s [id=arn:aws:ecs:us-east-1:702160845026:service/orderful-cluster/orderful-test-app]
module.ecs.aws_appautoscaling_target.ecs_target: Creating...
module.ecs.aws_appautoscaling_target.ecs_target: Creation complete after 0s [id=service/orderful-cluster/orderful-test-app]
module.ecs.aws_appautoscaling_policy.CPUTaskAutoScaling: Creating...
module.ecs.aws_appautoscaling_policy.MemoryTaskAutoScaling: Creating...
module.ecs.aws_appautoscaling_policy.MemoryTaskAutoScaling: Creation complete after 0s [id=ecs-task-memory-autoscaling]
module.ecs.aws_appautoscaling_policy.CPUTaskAutoScaling: Creation complete after 1s [id=ecs-task-cpu-autoscaling]
module.ecs.aws_cloudfront_distribution.orderful: Still creating... [10s elapsed]
module.ecs.aws_cloudfront_distribution.orderful: Still creating... [20s elapsed]
module.ecs.aws_cloudfront_distribution.orderful: Still creating... [30s elapsed]
module.ecs.aws_cloudfront_distribution.orderful: Still creating... [40s elapsed]
module.ecs.aws_cloudfront_distribution.orderful: Still creating... [50s elapsed]
module.ecs.aws_cloudfront_distribution.orderful: Still creating... [1m0s elapsed]
module.ecs.aws_cloudfront_distribution.orderful: Still creating... [1m10s elapsed]
module.ecs.aws_cloudfront_distribution.orderful: Still creating... [1m20s elapsed]
module.ecs.aws_cloudfront_distribution.orderful: Still creating... [1m30s elapsed]
module.ecs.aws_cloudfront_distribution.orderful: Still creating... [1m40s elapsed]
module.ecs.aws_cloudfront_distribution.orderful: Still creating... [1m50s elapsed]
module.ecs.aws_cloudfront_distribution.orderful: Still creating... [2m0s elapsed]
module.ecs.aws_cloudfront_distribution.orderful: Still creating... [2m10s elapsed]
module.ecs.aws_cloudfront_distribution.orderful: Still creating... [2m20s elapsed]
module.ecs.aws_cloudfront_distribution.orderful: Still creating... [2m30s elapsed]
module.ecs.aws_cloudfront_distribution.orderful: Still creating... [2m40s elapsed]
module.ecs.aws_cloudfront_distribution.orderful: Creation complete after 2m46s [id=E37YTS7J3JEIZ1]

Apply complete! Resources: 48 added, 0 changed, 0 destroyed.

Outputs:

endpoint_url = "d782dehmq2neu.cloudfront.net/api/health/check"

```

</details>

*Pushed by: @juliosaraiva, Action: `pull_request`*